import { Test, TestingModule } from '@nestjs/testing';
import { TimetableService } from './timetable.service';

describe('TimetableService', () => {
  let service: TimetableService;

  beforeEach(async () => {
    const module: TestingModule = await Test.createTestingModule({
      providers: [TimetableService],
    }).compile();

    service = module.get<TimetableService>(TimetableService);
  });

  describe('setTimetable', () => {
    it('should set timetable in database', async () => {
      jest.spyOn(service, 'setTimetable');
      expect(
        await service.setTimetable(
          { groupId: '1I-2-23' },
          {
            lessons: [
              ['', '', '', ''],
              ['Разговоры о важном', '105', 'Чернышева|А|М|', ''],
              ['Индивидуальный проект', '202', 'Перепеличный|Ф|С|', ''],
              ['Физика', '401', 'Башанаев|Р|К|', ''],
              ['Математика', '410', 'Соловьева|Е|К|', ''],
              ['История', '309', 'Ситнова|О|А|', ''],
              [
                'Введение нейросети и искусственный интелект',
                '105',
                'Чернышева|А|М|',
                '',
              ],
              ['Литература', '407', 'Степченкова|В|А|', ''],
              [
                'Обеспечение безопасного функционирования компьютерных сетей',
                '105',
                'Чернышева|А|М|',
                '',
              ],
              ['Информатика', '204', 'Иванова|В|А|', ''],
              ['Русский язык', '407', 'Степченкова|В|А|', ''],
              ['География', '408', 'Фейзуллаева|Э|М|', ''],
              [
                'ДУП 01 Технологиия выполнения работ по профессии"Консультант в области развития цифровой грамотности населения (цифровой куратор)"',
                '_204',
                'Иванова|В|А|',
                '',
              ],
              [
                'Консбедициальное делопроизводство',
                '105',
                'Чернышева|А|М|',
                '',
              ],
              ['Биология', '406', 'Фимин|К|С|', ''],
              ['Обществознание', '309', 'Ситнова|О|А|', ''],
              [
                'Основы безопасности жизнедеятельности',
                '310',
                'Смирнов|А|М|',
                '',
              ],
              ['Физическая культура', 'Трен', 'Чернова|Л|Л|', ''],
            ],
            even: [
              [1, 2, 3, 4, 0, 0],
              [0, 5, 6, 4, 7, 0],
              [0, 8, 9, 10, 11, 0],
              [0, 0, 3, 12, 8, 0],
              [0, 0, 13, 14, 15, 4],
              [0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0],
            ],
            odd: [
              [1, 16, 3, 4, 0, 0],
              [0, 5, 6, 4, 7, 0],
              [0, 8, 17, 10, 11, 0],
              [0, 0, 4, 12, 8, 0],
              [0, 0, 13, 14, 15, 4],
              [0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0],
            ],
            times: [
              ['8', '10', '8', '55'],
              ['9', '00', '10', '30'],
              ['10', '50', '12', '20'],
              ['12', '40', '14', '10'],
              ['14', '30', '16', '00'],
              ['16', '10', '17', '40'],
            ],
          },
        ),
      );
    });
  });
});
